
## Plan Result (stg)




<pre><code>Plan: 1 to add, 12 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_storage_share.dets-file-share[0]
* Update
  * azurerm_subnet.migration[0]
  * azurerm_subnet.postgres[0]
  * azurerm_windows_virtual_machine.modernisation_windows[&#34;stgdartsmidmock&#34;]
  * module.darts_redis.azurerm_redis_cache.redis
  * module.sa.azapi_update_resource.defender_settings
  * module.sa.azurerm_storage_account.storage_account
  * module.sa-dets-standard[0].azapi_update_resource.defender_settings
  * module.sa-dets-standard[0].azurerm_storage_account.storage_account
  * module.sa-migration-standard[0].azapi_update_resource.defender_settings
  * module.sa-migration-standard[0].azurerm_storage_account.storage_account
  * module.sa_dets[0].azapi_update_resource.defender_settings
  * module.sa_dets[0].azurerm_storage_account.storage_account


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_storage_share.dets-file-share[0] will be created
  + resource "azurerm_storage_share" "dets-file-share" {
      + access_tier          = (known after apply)
      + enabled_protocol     = "SMB"
      + id                   = (known after apply)
      + metadata             = (known after apply)
      + name                 = "dets-file-share"
      + quota                = 50
      + resource_manager_id  = (known after apply)
      + storage_account_name = "sastgdartsartefacts"
      + url                  = (known after apply)
    }

  # azurerm_subnet.migration[0] will be updated in-place
  ~ resource "azurerm_subnet" "migration" {
        id                                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.Network/virtualNetworks/migration-vnet/subnets/migration-subnet"
        name                                          = "migration-subnet"
      ~ private_endpoint_network_policies             = "Enabled" -> "Disabled"
        # (7 unchanged attributes hidden)
    }

  # azurerm_subnet.postgres[0] will be updated in-place
  ~ resource "azurerm_subnet" "postgres" {
        id                                            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.Network/virtualNetworks/migration-vnet/subnets/postgres-sn"
        name                                          = "postgres-sn"
      ~ private_endpoint_network_policies             = "Enabled" -> "Disabled"
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # azurerm_windows_virtual_machine.modernisation_windows["stgdartsmidmock"] will be updated in-place
  ~ resource "azurerm_windows_virtual_machine" "modernisation_windows" {
        id                                                     = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-stg-rg/providers/Microsoft.Compute/virtualMachines/stgdartsmidmock"
        name                                                   = "stgdartsmidmock"
      ~ patch_assessment_mode                                  = "AutomaticByPlatform" -> "ImageDefault"
        tags                                                   = {
            "application"         = "darts"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "staging"
            "managedBy"           = "Darts Modernisation"
        }
        # (25 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.darts_redis.azurerm_redis_cache.redis will be updated in-place
  ~ resource "azurerm_redis_cache" "redis" {
        id                                 = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-stg-rg/providers/Microsoft.Cache/redis/darts-stg"
        name                               = "darts-stg"
        tags                               = {
            "application"         = "darts"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "staging"
            "managedBy"           = "Darts Modernisation"
        }
        # (22 unchanged attributes hidden)

      ~ redis_configuration {
          - data_persistence_authentication_method  = "SAS" -> null
            # (11 unchanged attributes hidden)
        }
    }

  # module.sa.azapi_update_resource.defender_settings will be updated in-place
  ~ resource "azapi_update_resource" "defender_settings" {
      ~ body                    = jsonencode(
            {
              - properties = {
                  - isEnabled                         = false
                  - malwareScanning                   = {
                      - onUpload = {
                          - capGBPerMonth = -1
                          - isEnabled     = false
                        }
                    }
                  - overrideSubscriptionLevelSettings = true
                  - sensitiveDataDiscovery            = {
                      - isEnabled = false
                    }
                }
            }
        ) -> {
          + properties = {
              + isEnabled                         = false
              + malwareScanning                   = {
                  + onUpload = {
                      + capGBPerMonth = -1
                      + isEnabled     = false
                    }
                }
              + overrideSubscriptionLevelSettings = true
              + sensitiveDataDiscovery            = {
                  + isEnabled = false
                }
            }
        }
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-stg-rg/providers/Microsoft.Storage/storageAccounts/dartssastg/providers/Microsoft.Security/DefenderForStorageSettings/current"
        name                    = "current"
      ~ output                  = jsonencode({}) -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.sa.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
      ~ cross_tenant_replication_enabled  = true -> false
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-stg-rg/providers/Microsoft.Storage/storageAccounts/dartssastg"
        name                              = "dartssastg"
        tags                              = {
            "application"         = "darts"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "staging"
            "managedBy"           = "Darts Modernisation"
        }
        # (51 unchanged attributes hidden)

      + network_rules {
          + bypass         = [
              + "AzureServices",
            ]
          + default_action = "Allow"
        }

        # (3 unchanged blocks hidden)
    }

  # module.sa-dets-standard[0].azapi_update_resource.defender_settings will be updated in-place
  ~ resource "azapi_update_resource" "defender_settings" {
      ~ body                    = jsonencode(
            {
              - properties = {
                  - isEnabled                         = false
                  - malwareScanning                   = {
                      - onUpload = {
                          - capGBPerMonth = -1
                          - isEnabled     = false
                        }
                    }
                  - overrideSubscriptionLevelSettings = true
                  - sensitiveDataDiscovery            = {
                      - isEnabled = false
                    }
                }
            }
        ) -> {
          + properties = {
              + isEnabled                         = false
              + malwareScanning                   = {
                  + onUpload = {
                      + capGBPerMonth = -1
                      + isEnabled     = false
                    }
                }
              + overrideSubscriptionLevelSettings = true
              + sensitiveDataDiscovery            = {
                  + isEnabled = false
                }
            }
        }
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-stg-rg/providers/Microsoft.Storage/storageAccounts/stgdetsdarts/providers/Microsoft.Security/DefenderForStorageSettings/current"
        name                    = "current"
      ~ output                  = jsonencode({}) -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.sa-dets-standard[0].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
      ~ cross_tenant_replication_enabled  = true -> false
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-stg-rg/providers/Microsoft.Storage/storageAccounts/stgdetsdarts"
        name                              = "stgdetsdarts"
        tags                              = {
            "application"         = "darts"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "staging"
            "managedBy"           = "Darts Modernisation"
        }
        # (39 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sa-migration-standard[0].azapi_update_resource.defender_settings will be updated in-place
  ~ resource "azapi_update_resource" "defender_settings" {
      ~ body                    = jsonencode(
            {
              - properties = {
                  - isEnabled                         = false
                  - malwareScanning                   = {
                      - onUpload = {
                          - capGBPerMonth = -1
                          - isEnabled     = false
                        }
                    }
                  - overrideSubscriptionLevelSettings = true
                  - sensitiveDataDiscovery            = {
                      - isEnabled = false
                    }
                }
            }
        ) -> {
          + properties = {
              + isEnabled                         = false
              + malwareScanning                   = {
                  + onUpload = {
                      + capGBPerMonth = -1
                      + isEnabled     = false
                    }
                }
              + overrideSubscriptionLevelSettings = true
              + sensitiveDataDiscovery            = {
                  + isEnabled = false
                }
            }
        }
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.Storage/storageAccounts/sastgdartsmig02/providers/Microsoft.Security/DefenderForStorageSettings/current"
        name                    = "current"
      ~ output                  = jsonencode({}) -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.sa-migration-standard[0].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
      ~ cross_tenant_replication_enabled  = true -> false
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.Storage/storageAccounts/sastgdartsmig02"
        name                              = "sastgdartsmig02"
        tags                              = {
            "application"         = "darts"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "staging"
            "managedBy"           = "Darts Modernisation"
        }
        # (39 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sa_dets[0].azapi_update_resource.defender_settings will be updated in-place
  ~ resource "azapi_update_resource" "defender_settings" {
      ~ body                    = jsonencode(
            {
              - properties = {
                  - isEnabled                         = false
                  - malwareScanning                   = {
                      - onUpload = {
                          - capGBPerMonth = -1
                          - isEnabled     = false
                        }
                    }
                  - overrideSubscriptionLevelSettings = true
                  - sensitiveDataDiscovery            = {
                      - isEnabled = false
                    }
                }
            }
        ) -> {
          + properties = {
              + isEnabled                         = false
              + malwareScanning                   = {
                  + onUpload = {
                      + capGBPerMonth = -1
                      + isEnabled     = false
                    }
                }
              + overrideSubscriptionLevelSettings = true
              + sensitiveDataDiscovery            = {
                  + isEnabled = false
                }
            }
        }
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.Storage/storageAccounts/sastgdartsartefacts/providers/Microsoft.Security/DefenderForStorageSettings/current"
        name                    = "current"
      ~ output                  = jsonencode({}) -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.sa_dets[0].azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
      ~ cross_tenant_replication_enabled  = true -> false
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.Storage/storageAccounts/sastgdartsartefacts"
        name                              = "sastgdartsartefacts"
        tags                              = {
            "application"         = "darts"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "staging"
            "managedBy"           = "Darts Modernisation"
        }
        # (51 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 1 to add, 12 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":310,"Program":"tfcmt","SHA1":"","Target":"stg","Vars":{}} -->